[
  {
    "id": "1",
    "type": "Daily",
    "notes": "",
    "benefits": "The Prophet, peace and blessings be upon him, always started and ended his day with dhikir.",
    "source": "HR. al-Bukhari",
    "fawaid": "",
    "titleMalay": "Doa Sebelum Tidur",
    "title": "Dua Before Sleeping",
    "melayTranslation": "Dengan menyebut nama-Mu, ya Allah! Aku mati dan dan hidup.",
    "translation": "In Your name, O Allah! I live and die.",
    "arabic": "بِاسْمِكَ اللَّهُمَّ أَمُوْتُ وَأَحْيَا",
    "latin": "Bismikallahumma amūtu wa aḥyā"
  },
  {
    "id": "2",
    "type": "Daily",
    "notes": "",
    "benefits": "By reciting the supplication above, a servant begins his day by praising the name of Allah, the Giver of Life and the Bringer of Death.",
    "source": "HR. Bukhari: 6327",
    "fawaid": "",
    "titleMalay": "Doa Bangun Tidur",
    "title": "Dua Upon Waking Up",
    "melayTranslation": "Segala puji bagi Allah, yang telah membangunkan kami setelah menidurkan kami dan kepada-Nya lah kami dibangkitkan.",
    "translation": "All praise is for Allah who revived us after He made us sleep, and to Him is the resurrection.",
    "arabic": "الحَمْدُ للهِ الَّذِي أَحْيَانَا بعْدَ مَا أماتَنَا وإِلَيْهِ النُّشُورُ",
    "latin": "Alhamdulillāhillażī aḥyānā ba‘da mā amātanā wa ilayhin-nushūr"
  },
  {
    "id": "3",
    "title": "Dua Before Entering the Bathroom",
    "type": "Daily",
    "latin": "Allahumma innī a‘ūdzu bika minal-khubthi wal-khabā",
    "notes": "",
    "benefits": "This supplication acts as a barrier between a servant's private parts and the jinn when entering the bathroom.",
    "source": "HR. al-Bukhari and Muslim",
    "fawaid": "",
    "titleMalay": "Doa Masuk Kamar Mandi",
    "melayTranslation": "Ya Allah, aku berlindung pada-Mu dari (godaan) syaitan laki-laki dan perempuan.",
    "translation": "O Allah, I seek refuge with You from the male and female devils.",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ"
  },
  {
    "id": "4",
    "title": "Dua After Leaving the Bathroom",
    "type": "Daily",
    "notes": "",
    "benefits": "The bathroom is one of the homes of the jinn and devils, so it is recommended to ask for forgiveness for any mistakes, intentional or unintentional, made while in the bathroom.",
    "source": "HR. at-Tirmidzi",
    "fawaid": "",
    "titleMalay": "Doa Keluar Kamar Mandi",
    "melayTranslation": "Segala puji bagi Allah yang telah menghilangkan bahaya dariku dan memberi kesihatan",
    "translation": "All praise is to Allah who removed harm from me and granted me health.",
    "arabic": "الحمد لله الذي أذهب عني الأذى وعافاني",
    "latin": "Alhamdulillāhillażī aḏhaba 'annī al-aḏā wa 'āfānī"
  },
  {
    "id": "5",
    "type": "Daily",
    "notes": "",
    "benefits": "The benefit of reciting Bismillah before eating is to prevent Satan from joining humans in eating.",
    "source": "HR. al-Bukari No. 5376 and Muslim No. 2022",
    "fawaid": "",
    "titleMalay": "Doa Sebelum Makan",
    "title": "Dua Before Eating",
    "melayTranslation": "Ya Allah, berkahilah kami dalam rezeki yang Engkau berikan dan lindungilah kami dari azab neraka",
    "translation": "O Allah, bless us in the sustenance You have given and protect us from the punishment of Hellfire.",
    "arabic": "اللَّهُمَّ بَارِكْ لَنَا فِيمَا رَزَقْتَنَا وَقِنَا عَذَابَ النَّارِ",
    "latin": "Allahumma bārik lanā fīmā razaqtanā wa qinā 'ażāban-nār"
  },
  {
    "id": "6",
    "type": "Daily",
    "notes": "",
    "benefits": "Islam pays great attention to etiquette. If someone forgets to recite the supplication before eating at the beginning, it is still recommended to recite it in the middle, even if there is only a spoonful of rice left.",
    "source": "HR. Abu Dawud",
    "fawaid": "",
    "titleMalay": "Doa Jika Terlupa Basmallah Diawal Makan",
    "title": "Dua If One Forgets Basmallah at the Start of a Meal",
    "melayTranslation": "Dengan menyebut nama Allah, untuk awal dan akhir (makan).",
    "translation": "In the name of Allah, for the beginning and the end (of this meal).",
    "arabic": "بِسْمِ اللَّهِ أَوَّلَهُ وَآخِرَهُ",
    "latin": "Bismillāhi awwalahu wa ākhirahu"
  },
  {
    "id": "7",
    "type": "Daily",
    "notes": "",
    "benefits": "The Messenger of Allah, peace and blessings be upon him, said that if someone recites this supplication, then his past sins will be forgiven.",
    "source": "Shahih at-Tirmidzi",
    "fawaid": "",
    "titleMalay": "Doa Sesudah Makan",
    "title": "Dua After Eating",
    "melayTranslation": "Segala puji bagi Allah yang telah memberiku makanan ini, dan memberikan rezeki kepadaku tanpa daya serta kekuatan dariku.",
    "translation": "All praise is to Allah who fed me this and provided it to me without any power or strength from myself.",
    "arabic": "الْحَمْدُ لِلَّهِ الَّذِى أَطْعَمَنِى هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّى وَلاَ قُوَّةٍ",
    "latin": "Alhamdulillāhillażī aṭ'amanī hāżā wa razaqanīhi min ghayri ḥawlin minnī wa lā quwwah"
  },
  {
    "id": "8",
    "type": "Daily",
    "notes": "",
    "benefits": "The mosque is the house of Allah; a servant should honor it and hope for Allah's mercy within it.",
    "source": "HR. Muslim",
    "fawaid": "",
    "titleMalay": "Doa Masuk Masjid",
    "title": "Dua When Entering the Mosque",
    "melayTranslation": "Ya Allah, bukalah pintu-pintu rahmat-Mu untukku.",
    "translation": "O Allah, open the doors of Your mercy for me.",
    "arabic": "اَللَّهُمَّ افْتَحْ لِيْ أَبْوَابَ رَحْمَتِكَ",
    "latin": "Allahumma iftaḥ lī abwāba raḥmatik"
  },
  {
    "id": "9",
    "type": "Daily",
    "notes": "",
    "benefits": "Allah's earth is vast, and there are many ways to seek provision. A servant should ask for Allah's bounty to be facilitated in obtaining the provision that Allah has distributed to all His servants.",
    "source": "HR. Muslim No. 713",
    "fawaid": "",
    "titleMalay": "Doa Keluar Masjid",
    "title": "Dua When Leaving the Mosque",
    "melayTranslation": "Ya Allah, sesungguhnya aku memohon karunia-Mu.",
    "translation": "O Allah, indeed I ask You for Your bounty.",
    "arabic": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ مِنْ فَضْلِكَ",
    "latin": "Allahumma innī as'aluka min faḍlik"
  },
  {
    //translation not there
    "id": "10",
    "title": "Supplication Before Performing Ablution",
    "type": "Daily",
    "arabic": "بِسْمِ اللَّهِ",
    "latin": "bismillah",
    "translation": "In the name of Allah.",
    "notes": "",
    "benefits": "It is prescribed to begin every important matter by saying Bismillah, whether it be an act of worship or otherwise.",
    "source": "HR. at-Tirmidzi and al-Baihaqi",
    "fawaid": ""
  },
  {
    "id": "11",
    "type": "Daily",
    "notes": "",
    "benefits": "Whoever recites this supplication, eight gates of Paradise will be opened for him, and he may enter from whichever gate he wishes.",
    "source": "HR. Muslim, at-Tirmidzi and an-Nasa'i",
    "fawaid": "",
    "titleMalay": "Doa Sesudah Berwudhu",
    "title": "Dua After Performing Ablution (Wudu)",
    "melayTranslation": "Aku bersaksi bahwa tidak ada tuhan selain Allah semata yang tidak ada sekutu bagi-Nya dan aku pun bersaksi bahwa Muhammad adalah hamba sekaligus Rasul utusan-Nya. Ya Allah, jadikanlah aku termasuk orang-orang yang bertaubat dan jadikanlah aku termasuk orang-orang yang bersuci.",
    "translation": "I bear witness that there is no god but Allah alone, without partner, and I bear witness that Muhammad is His servant and Messenger. O Allah, make me among those who repent and purify themselves.",
    "arabic": "أشْهَدُ أنْ لا إله إِلاَّ اللَّهُ وَحْدَهُ لا شَرِيك لَهُ ، وأشْهَدُ أنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ ، اللَّهُمَّ اجْعَلْنِي مِنَ التَوَّابِينَ ، واجْعَلْني مِنَ المُتَطَهِّرِينَ",
    "latin": "Ash-hadu allā ilāha illallāh, waḥdahu lā sharīka lah, wa ash-hadu anna Muḥammadan 'abduhū wa rasūluh. Allahummaj'alnī minat-tawwābīn waj'alnī minal-mutaṭahhirīn"
  },
  {
    "id": "12",
    "type": "Daily",
    "notes": "",
    "benefits": "It is highly recommended for those who are fasting to increase their supplications before and after breaking the fast, because the supplication of a fasting person is one of the three supplications that are not rejected.",
    "source": "HR. Abu Daud, As-Sunan Al-Kubra Lil Baihaqi, Vol. 4, p. 239, al-Hakim in Mustadrak 'alas Shahihain No. 1484",
    "fawaid": "",
    "titleMalay": "Doa Buka Puasa",
    "title": "Dua for Breaking the Fast",
    "melayTranslation": "Rasa haus telah hilang, urat-urat telah basah, dan pahala telah ditetapkan insya Allah.",
    "translation": "The thirst is gone, the veins are moistened, and the reward is confirmed, if Allah wills.",
    "arabic": "ذَهَبَ الظَّمَأُ وابْتَلَّتِ الْعُرُوقُ وثَبَتَ اْلأَجْرُ إِنْ شَاءَ اللهُ",
    "latin": "Żahabaẓ-ẓama'u wabtallatil-'urūqu wa thabatal-ajru in shā' Allāh"
  },
  {
    "id": "13",
    "type": "Daily",
    "notes": "",
    "benefits": "The greeting is a supplication of hope, a hope that you will be safe from all kinds of sorrow and suffering, and be enveloped in mercy and blessings.",
    "source": "HR. at-Tirmidzi",
    "fawaid": "",
    "titleMalay": "Doa Masuk Rumah #1",
    "title": "Dua When Entering the House (#1)",
    "melayTranslation": "Dengan nama Allah kami masuk, dengan nama Allah kami keluar, dan kepada Allah, Tuhan kami, kami bertawakal",
    "translation": "In the name of Allah we enter and in the name of Allah we leave, and upon our Lord we rely.",
    "arabic": "ابِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا",
    "latin": "Bismillāhi walajnā, wa bismillāhi kharajnā, wa 'alallāhi rabbinā tawakkalnā"
  },
  {
    "id": "14",
    "title": "Supplication Entering the House #2",
    "type": "Daily",
    "arabic": "اَلسَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللهِ وَبَرَكَا تُهُ",
    "latin": "assalaamu 'alaykum warahmatullaahi wabarakaatuh",
    "translation": "Peace, mercy, and blessings of Allah be upon you.",
    "notes": "",
    "benefits": "The greeting is a supplication of hope, a hope that you will be safe from all kinds of sorrow and suffering, and be enveloped in mercy and blessings.",
    "source": "HR. at-Tirmidzi",
    "fawaid": ""
  },
  {
    "id": "15",
    "type": "Daily",
    "notes": "",
    "benefits": "Whoever recites this supplication, it will be said to him: \"You will be guided, sufficed, and protected.\" Satan will then depart from him. Another satan will say: \"How can you harm someone who has been guided, sufficed, and protected?!\"",
    "source": "HR. Abu Dawud and at-Tirmidzi",
    "fawaid": "",
    "titleMalay": "Doa Keluar Rumah",
    "title": "Dua When Leaving the House",
    "melayTranslation": "Dengan nama Allah, aku bertawakkal kepada Allah, tiada daya dan kekuatan kecuali dengan pertolongan Allah.",
    "translation": "In the name of Allah, I place my trust in Allah, there is no power nor might except with Allah.",
    "arabic": "بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
    "latin": "Bismillāhi tawakkaltu 'alallāh, lā ḥawla wa lā quwwata illā billāh"
  },
  {
    "id": "16",
    "type": "Daily",
    "notes": "",
    "benefits": "When a person leaves the house, they will encounter all kinds of things, both good and bad, especially harm caused by themselves. Therefore, it is commanded to seek refuge from oneself and from others.",
    "source": "HR. Abu Dawud, at-Tirmidzi, Ibn Majah and an-Nasa'i",
    "fawaid": "",
    "titleMalay": "Doa Agar Tidak Menyebabkan Keburukan atau Terkena Keburukan Di luar Rumah",
    "title": "Dua for Protection from Causing or Experiencing Harm Outside the House",
    "melayTranslation": "Ya Allah, aku berlindung kepada-Mu, jangan sampai aku sesat atau disesatkan (setan atau orang yang berwatak setan), berbuat kesalahan atau disalahi, menganiaya atau dianiaya (orang), dan berbuat bodoh atau dibodohi.",
    "translation": "O Allah, I seek refuge with You lest I stray or be led astray, slip or be slipped, oppress or be oppressed, behave foolishly or be treated foolishly.",
    "arabic": "اللَّهُمَّ إِنِّى أَعُوذُ بِكَ أَنْ أَضِلَّ أَوْ أُضَلَّ أَوْ أَزِلَّ أَوْ أُزَلَّ أَوْ أَظْلِمَ أَوْ أُظْلَمَ أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَىَّ",
    "latin": "Allahumma innī a'ūdzu bika an aḍilla aw uḍalla aw azilla aw uzalla aw aẓlima aw uẓlama aw ajhala aw yujhala 'alayya"
  },
  {
    "id": "17",
    "type": "Daily",
    "notes": "",
    "benefits": "This supplication has two parts. The first is praise of Allah and the submission of the servant. The second is a request to Allah for ease in travel and in the affairs of what the servant has left at home.",
    "source": "HR. Muslim",
    "fawaid": "",
    "titleMalay": "Doa Safar",
    "title": "Dua for Traveling (Safar)",
    "melayTranslation": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Maha Suci Allah yang telah menundukkan untuk kami kendaraan ini, padahal kami sebelumnya tidak mempunyai kemampuan untuk melakukannya, dan sesungguhnya hanya kepada Rabb kami, kami akan kembali. Ya Allah, sesungguhnya kami memohon kepada-Mu kebaikan, ketakwaan, dan amal yang Engkau ridhai dalam perjalanan kami ini. Ya Allah, mudahkanlah perjalanan kami ini, dekatkanlah bagi kami jarak yang jauh. Ya Allah, Engkau adalah rekan dalam perjalanan dan pengganti di tengah keluarga. Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kesukaran perjalanan, tempat kembali yang menyedihkan, dan pemandangan yang buruk pada harta, keluarga, dan anak.",
    "translation": "Allah is the Greatest, Allah is the Greatest, Allah is the Greatest. Glory be to Him who has subjected this (vehicle) to us, and we could never have accomplished it (by ourselves). Indeed, to our Lord we will surely return. O Allah, we ask You for goodness, piety, and deeds pleasing to You on this journey. O Allah, ease our journey and make the distance short for us. You are the Companion on the journey and the Guardian over our families. O Allah, I seek refuge with You from the hardship of travel, from having a sorrowful return, and from a bad view in property, family, and children.",
    "arabic": "الله أَكْبَرُ،الله أَكْبَرُ،الله أَكْبَرُ،سُبْحَانَ الَّذِى سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ اللَّهُمَّ إِنَّا نَسْأَلُكَ فِى سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى وَمِنَ الْعَمَلِ مَا تَرْضَى اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ اللَّهُمَّ أَنْتَ الصَّاحِبُ فِى السَّفَرِ وَالْخَلِيفَةُ فِى الأَهْلِ اللَّهُمَّ إِنِّى أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمَنْظَرِ وَسُوءِ الْمُنْقَلَبِ فِى الْمَالِ وَالأَهْلِ",
    "latin": "Allāhu akbar, Allāhu akbar, Allāhu akbar, subḥānallażī sakhkhara lanā hāżā wa mā kunnā lahu muqrinīn wa innā ilā rabbinā lamunqalibūn. Allahumma innā nas'aluka fī safarinā hāżā al-birra wat-taqwā wa minal-'amali mā tarḍā. Allahumma hawwin 'alainā safaranā hāżā waṭwi 'annā bu'dah. Allahumma anta aṣ-ṣāḥibu fis-safar wal-khalīfatu fil-ahli. Allahumma innī a'ūdzu bika min wa'thā'is-safar wa ka'ābatil-manẓar wa sū'il-munqalabi fil-māli wal-ahli"
  },
  {
    "id": "18",
    "type": "Daily",
    "notes": "",
    "benefits": "Three priorities of a servant that must be maintained everywhere: religion, trust, and deeds, because a person will be resurrected according to their deeds.",
    "source": "HR. Abu Dawud: 2601",
    "fawaid": "",
    "titleMalay": "Doa Orang Mukim Kepada Orang yang Hendak Bersafar",
    "title": "Dua from a Resident to Someone Who is Traveling",
    "melayTranslation": "Aku menetipkan agamamu, amanahmu, dan amal terakhir kepada Allah.",
    "translation": "I entrust your religion, your trust, and your final deeds to Allah.",
    "arabic": "أَسْتَوْدِعُ اللَّهَ دِينَكَ وَأَمَانَتَكَ وَخَوَاتِيمَ عَمَلِكَ",
    "latin": "Astaudi'ullāha dīnaka wa amānataka wa khawātīma 'amalik"
  },
  {
    "id": "19",
    "type": "Daily",
    "notes": "",
    "benefits": "Piety is the best provision that a servant must prepare for the Hereafter, because there is no salvation except through piety.",
    "source": "HR. at-Tirmidzi",
    "fawaid": "",
    "titleMalay": "Doa Bekal Takwa dari Orang Mukim Kepada yang Hendak Bersafar",
    "title": "Dua for Provision and Piety from a Resident to a Traveler",
    "melayTranslation": "Semoga Allah membekalimu ketakwaan, mengampuni dosamu, dan memudahkan kebaikan untukmu dimanapun kamu berada.",
    "translation": "May Allah provide you with piety, forgive your sins, and make goodness easy for you wherever you are.",
    "arabic": "زَوَّدَكَ اللَّهُ التَّقْوَى وَغَفَرَ ذَنْبَكَ  وَيَسَّرَ لَكَ الْخَيْرَ حَيْثُمَا كُنْتَ",
    "latin": "Zawwadakallāhut-taqwā wa ghafara dzanbak wa yassara laka al-khayra ḥaytsumā kunta"
  },
  {
    "id": "20",
    "type": "Daily",
    "notes": "",
    "benefits": "By reciting this supplication, one asks that the clothes they have bought may provide goodness and also be a protection against various evils.",
    "source": "HR. Ahmad, Abu Dawud, at-Tirmidzi and Al-Hakim",
    "fawaid": "",
    "titleMalay": "Doa Memakai Pakaian Baru",
    "title": "Dua When Wearing New Clothes",
    "melayTranslation": "Ya Allah, hanya milik-Mu lah segala pujian. Engkaulah yang memberi pakaian ini kepadaku. Aku memohon kepada-Mu agar memperoleh kebaikan dari pakaian ini dan kebaikan yang ia diciptakan karenanya. Aku berlindung kepada-Mu dari kejahatannya dan kejahatan yang diciptakan karenanya.",
    "translation": "O Allah, all praise is to You. You clothed me with this. I ask You for its goodness and the goodness of what it was made for, and I seek refuge with You from its evil and the evil of what it was made for.",
    "arabic": "اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيهِ أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ",
    "latin": "Allahumma lakal-ḥamdu anta kasautanīhi as'aluka min khayrihī wa khayri mā ṣuni'a lah, wa a'ūdzu bika min sharrihi wa sharri mā ṣuni'a lah"
  },
  {
    "id": "21",
    "type": "Daily",
    "notes": "",
    "benefits": "The virtue of reciting this supplication is that past sins will be forgiven, God willing.",
    "source": "HR. all compilers of Sunan books, except Nasa'i",
    "fawaid": "",
    "titleMalay": "Doa Memakai Pakaian",
    "title": "Dua When Putting On Clothes",
    "melayTranslation": "Segala puji bagi Allah yang memberi pakaian ini kepadaku sebagai rezeki dari-Nya tanpa daya dan kekuatan dariku.",
    "translation": "All praise is to Allah who provided me with this garment as sustenance from Him without any power or strength from myself.",
    "arabic": "الْحَمْدُ لِلَّهِ الَّذِى كَسَانِى هَذَا الثَّوْبَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّى وَلاَ قُوَّةٍ",
    "latin": "Alhamdulillāhillażī kasānī hāżā ath-thawba wa razaqanīhi min ghayri ḥawlin minnī wa lā quwwah"
  },
  {
    "id": "22",
    "type": "Daily",
    "notes": "",
    "benefits": "By reciting the supplication for mounting a vehicle, our journey will always be under the protection of Allah. In addition, we will also receive rewards, help, and a calmer heart.",
    "source": "HR. Abu Dawud and at-Tirmidzi",
    "fawaid": "",
    "titleMalay": "Doa Menaiki Kendaraan",
    "title": "Dua When Riding a Vehicle",
    "melayTranslation": "Dengan menyebut nama Allah (3x). Segala puji bagi Allah. Maha Suci Allah yang telah menundukkan semua ini bagi kami padahal kami sebelumnya tidak mampu menguasainya, dan sesungguhnya kami akan kembali kepada Rabb kami. Maha Suci Engkau, sesungguhnya aku telah mendzalimi diriku sendiri maka ampunilah aku, karena tidak ada yang mengampuni dosa-dosa selain Engkau.",
    "translation": "In the name of Allah (3x). All praise is to Allah. Glory be to Him who has subjected these for us, and we could never have accomplished it (by ourselves). Indeed, we will surely return to our Lord. Glory be to You, I have wronged myself, so forgive me, for none forgives sins except You.",
    "arabic": "سُبْحَانَ الَّذِى سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ",
    "latin": "Subḥānallażī sakhkhara lanā hāżā wa mā kunnā lahu muqrinīn wa innā ilā rabbinā lamunqalibūn"
  },
  {
    "id": "23",
    "type": "Daily",
    "notes": "",
    "benefits": "It is encouraged to pray when it rains so that goodness and blessings increase, as well as its benefits.",
    "source": "HR. al-Bukhari No. 1032",
    "fawaid": "",
    "titleMalay": "Doa Ketika Turun Hujan",
    "title": "Dua When Rain Falls",
    "melayTranslation": "Ya Allah turunkanlah pada kami hujan yang bermanfaat.",
    "translation": "O Allah, send upon us beneficial rain.",
    "arabic": "اللَّهُمَّ صَيِّبًا نَافِعًا",
    "latin": "Allahumma ṣayyiban nāfi'ā"
  },
  {
    "id": "24",
    "type": "Daily",
    "notes": "",
    "benefits": "The supplication above is recited when the rain gets heavier or there is a concern that the rain will cause harm.",
    "source": "HR. al-Bukhari No. 1014",
    "fawaid": "",
    "titleMalay": "Doa Ketika Hujan Lebat",
    "title": "Dua During Heavy Rain",
    "melayTranslation": "Ya Allah, turunkanlah hujan di sekitar kami, bukan untuk merusak kami. Ya Allah, turunkanlah hujan ke dataran tinggi, gunung-gunung, bukit-bukit, perut lembah dan tempat tumbuhnya pepohonan.",
    "translation": "O Allah, let the rain fall around us and not upon us. O Allah, send rain upon the hills, mountains, valleys, and growth areas.",
    "arabic": "اللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا ، اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ وَبُطُونِ الأَوْدِيَةِ وَمَنَابِتِ الشَّجَرِ",
    "latin": "Allahumma ḥawālainā wa lā 'alainā, Allahumma 'alal-ākāmi waẓ-ẓirābi wa buṭūnil-awdiyati wa manābiti ash-shajar"
  },
  {
    "id": "25",
    "title": "Supplication After it Rains",
    "type": "Daily",
    "arabic": "مُطِرْنا بفَضْلِ اللهِ ورَحْمَتِهِ",
    "latin": "muthirna bi fadhlillahi wa rohmatih",
    "translation": "We have been given rain by the bounty and mercy of Allah.",
    "notes": "",
    "benefits": "By reciting this supplication, one believes that rain falls by the will of Allah (Allah's virtue), not by the stars, so they do not become disbelievers in Allah.",
    "source": "HR. al-Bukhari No. 846 and Muslim No. 71",
    "fawaid": ""
  },
  {
    "id": "26",
    "type": "Daily",
    "notes": "",
    "benefits": "Among the signs of Allah's power is a strong wind that can bring blessings and punishment, namely good and bad. Therefore, a servant should continue to ask for good and seek refuge from all harm.",
    "source": "HR. Abu Dawud and Ibnu Majah",
    "fawaid": "",
    "titleMalay": "Doa Ketika Angin Kencang",
    "title": "Dua During Strong Wind",
    "melayTranslation": "Ya Allah, aku berlindung kepada-Mu dari kejahatan angin ribut dan dari kejahatan setiap makhluk yang Engkau pegang lehernya (berkuasa penuh atasnya)",
    "translation": "O Allah, I seek refuge with You from the evil of windstorms and from the evil of every creature that You hold under Your control.",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ الْعَاصِفِ وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا",
    "latin": "Allahumma innī a'ūdzu bika min sharri al-'āṣif wa min sharri kulli dābbatin anta ākhidzu bināṣiyatihā"
  },
  {
    "id": "27",
    "type": "Daily",
    "notes": "",
    "benefits": "Whoever recites it with certainty in the evening, and then he dies, he will enter Paradise, and likewise if (recited) in the morning.",
    "source": "HR. al-Bukhari No. 6306, 6323, Ahmad IV/122-125, an-Nasa'i VIII/279-280",
    "fawaid": "",
    "titleMalay": "Sayyid al-Istighfar",
    "title": "Sayyid al-Istighfar (The Master Supplication for Forgiveness)",
    "melayTranslation": "Ya Allah, Engkau adalah Rabb-ku, tidak ada Ilah (yang berhak diibadahi dengan benar) kecuali Engkau, Engkau-lah yang menciptakanku. Aku adalah hamba-Mu. Aku akan setia pada perjanjianku dengan-Mu semampuku. Aku berlindung kepada-Mu dari kejelekan (apa) yang kuperbuat. Aku mengakui nikmat-Mu (yang diberikan) kepadaku dan aku mengakui dosaku, oleh karena itu, ampunilah aku. Sesungguhnya tidak ada yang dapat mengampuni dosa kecuali Engkau.",
    "translation": "O Allah, You are my Lord, there is no god but You. You created me and I am Your servant. I uphold Your covenant and promise as best as I can. I seek refuge with You from the evil I have done. I acknowledge Your favor upon me, and I acknowledge my sin, so forgive me. Verily, none forgives sins but You.",
    "arabic": "اَللَّهُمَّ أَنْتَ رَبِّيْ ، لَا إِلٰـهَ إِلاَّ أَنْتَ خَلَقْتَنِيْ وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ ، أَعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوْءُ لَكَ بِنِعْمتِكَ عَلَيَّ ، وَأَبُوْءُ بِذَنْبِيْ فَاغْفِرْ لِيْ ، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ",
    "latin": "Allahumma anta rabbī, lā ilāha illā anta khalaqtanī wa anā 'abduka wa anā 'alā 'ahdika wa wa'dika mā istaṭa'tu, a'ūdzu bika min sharri mā ṣana'tu, abū'u laka bini'matika 'alayya wa abū'u bidzanbī faghfir lī fa'innahū lā yaghfirudz-dzunūba illā anta"
  },
  {
    "id": "28",
    "type": "Daily",
    "notes": "",
    "benefits": "Ease comes only from Allah. Even something difficult can become easy if Allah wills it.",
    "source": "HR. Ibn Hibban",
    "fawaid": "",
    "titleMalay": "Doa Meminta Kemudahan Dalam Segala Urusan",
    "title": "Dua for Ease in All Matters",
    "melayTranslation": "Ya Allah, tidak ada kemudahan kecuali Engkau buat mudah. Dan engkau menjadikan kesedihan (kesulitan), jika Engkau kehendaki pasti akan menjadi mudah.",
    "translation": "O Allah, there is no ease except what You make easy, and You can make difficulty easy if You will.",
    "arabic": "اللَّهُمَّ لاَ سَهْلَ إِلاَّ مَا جَعَلْتَهُ سَهْلاً وَأَنْتَ تَجْعَلُ الحَزْنَ إِذَا شِئْتَ سَهْلاً",
    "latin": "Allahumma lā sahla illā mā ja'altahu sahlā wa anta taj'alu al-ḥazna idzā shi'ta sahlā"
  },
  {
    "id": "29",
    "type": "Daily",
    "notes": "",
    "benefits": "A servant should recite the supplication above when afflicted by calamity with certainty and hope. God willing, with this, they will receive a better replacement.",
    "source": "HR. Muslim",
    "fawaid": "",
    "titleMalay": "Doa Tertimpa Musibah",
    "title": "Dua When Afflicted by a Calamity",
    "melayTranslation": "Segala sesuatu adalah milik Allah dan akan kembali pada-Nya. Ya Allah, berilah ganjaran terhadap musibah yang menimpaku dan berilah ganti dengan yang lebih baik.",
    "translation": "Indeed, to Allah we belong and to Him we shall return. O Allah, reward me for my affliction and replace it with something better.",
    "arabic": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ اللَّهُمَّ أْجُرْنِى فِى مُصِيبَتِى وَأَخْلِفْ لِى خَيْرًا مِنْهَا",
    "latin": "Innā lillāhi wa innā ilayhi rāji'ūn. Allahumma'jurnī fī muṣībatī wa akhlif lī khayran minhā"
  },
  {
    "id": "30",
    "type": "Daily",
    "notes": "",
    "benefits": "Lawful provision, even if it is little, is better than abundant unlawful wealth.",
    "source": "HR. at-Tirmidzi No. 2563",
    "fawaid": "",
    "titleMalay": "Doa Ketika Terlilit Hutang",
    "title": "Dua When in Debt",
    "melayTranslation": "Ya Allah cukupkanlah aku dengan yang halal dan jauhkanlah aku dari yang haram, dan cukupkanlah aku dengan karunia-Mu dari bergantung pada selain-Mu.",
    "translation": "O Allah, suffice me with what You have made lawful against what You have made unlawful, and enrich me with Your grace from dependence on others.",
    "arabic": "اللَّهُمَّ اكْفِنِى بِحَلاَلِكَ عَنْ حَرَامِكَ وَأَغْنِنِى بِفَضْلِكَ عَمَّنْ سِوَاكَ",
    "latin": "Allahummakfinī biḥalālika 'an ḥarāmik, wa aghninī bifaḍlika 'amman siwāk"
  },
  {
    "id": "31",
    "type": "Daily",
    "notes": "",
    "benefits": "Abu Umamah then narrated: After I practiced this supplication, Allah truly removed my anxiety and gave me the ability to repay my debt.",
    "source": "HR. Abu Dawud No. 1555",
    "fawaid": "",
    "titleMalay": "Doa Memohon Perlindungan Dari Sifat Malas, Kesedihan, dan Lilitan Hutang",
    "title": "Dua for Protection from Laziness, Sadness, and Being Overwhelmed by Debt",
    "melayTranslation": "Ya Allah, aku berlindung kepada-Mu dari kebingungan dan kesedihan, aku berlindung kepada-Mu dari kelemahan dan kemalasan, aku berlindung kepada-Mu dari ketakutan dan kekikiran, aku berlindung kepada-Mu dari lilitan hutang dan tekanan orang-orang.",
    "translation": "O Allah, I seek refuge with You from anxiety and sorrow, from weakness and laziness, from miserliness and cowardice, from the burden of debt and from being overpowered by men.",
    "arabic": "اَللّٰهُمَّ إِنِّى أَعُوْذُبِكَ مِنَ الْهَمِّ وَالْحَزْنِ وَأَعُوْذُبِكَ مِنَ الْعَجْزِ وَالْكَسَلِ وَأَعُوْذُبِكَ مِنَ الْجُبْنِ وَالْبُخْلِ وَأَعُوْذُبِكَ مِنْ غَلَبَتِ الدَّيْنِ وَقَهْرِ الرجال",
    "latin": "Allahumma innī a'ūdzu bika minal-hammi wal-ḥazani wa a'ūdzu bika minal-'ajzi wal-kasali wa a'ūdzu bika minal-jubni wal-bukhli wa a'ūdzu bika min ghalabatid-dayni wa qahrir-rijāl"
  },
  {
    "id": "32",
    "type": "Daily",
    "notes": "",
    "benefits": "Indeed, Allah loves sneezing because it moves a person to worship. It is encouraged to respond to the praise of Allah by someone who praises Allah, and vice versa.",
    "source": "HR. al-Bukhari",
    "fawaid": "",
    "titleMalay": "Doa Setelah Bersin",
    "title": "Dua After Sneezing",
    "melayTranslation": "Segala puji bagi Allah.",
    "translation": "All praise is to Allah.",
    "arabic": "الحَمْدُ للهِ",
    "latin": "Alhamdulillāh"
  },
  {
    "id": "33",
    "type": "Daily",
    "notes": "",
    "benefits": "Indeed, Allah loves sneezing because it moves a person to worship. It is encouraged to respond to the praise of Allah by someone who praises Allah, and vice versa.",
    "source": "HR. al-Bukhari",
    "fawaid": "",
    "titleMalay": "Doa Saat Mendengar Orang Bersin",
    "title": "Dua Upon Hearing Someone Sneeze",
    "melayTranslation": "Semoga Allah merahmatimu.",
    "translation": "May Allah have mercy on you.",
    "arabic": "يَرْحَمُكَ اللهُ",
    "latin": "Yarḥamukallāh"
  },
  {
    "id": "34",
    "type": "Daily",
    "notes": "",
    "benefits": "Indeed, Allah loves sneezing because it moves a person to worship. It is encouraged to respond to the praise of Allah by someone who praises Allah, and vice versa.",
    "source": "HR. al-Bukhari",
    "fawaid": "",
    "titleMalay": "Doa Balasan Kepada yang Mendoakan Kamu Bersin",
    "title": "Dua in Response to Someone Who Prays for You After Sneezing",
    "melayTranslation": "Semoga Allah memberikan petunjuk, dan memperbaiki keadaan kalian.",
    "translation": "May Allah guide you and rectify your condition.",
    "arabic": "يَهْدِيكُمُ اللهُ وَيُصْلِحُ بَالَكُمْ",
    "latin": "Yahdīkumul-lāh wa yuṣliḥu bālakum"
  },
  {
    "id": "35",
    "type": "Daily",
    "notes": "",
    "benefits": "A charming appearance is not enough provision for a Muslim, but it must be accompanied by noble character. Therefore, a Muslim should constantly ask for their character to be improved and beautified.",
    "source": "HR. Ahmad, authenticated by al-Albani in al-Irwa', 1/115",
    "fawaid": "",
    "titleMalay": "Doa Meminta Akhlak yang Baik",
    "title": "Dua for Good Character",
    "melayTranslation": "Ya Allah, sebagaimana Engkau memperbagus badanku maka perbaguslah akhlaku.",
    "translation": "O Allah, as You have beautified my outward appearance, beautify my character.",
    "arabic": "اللَّهُمَّ كَمَا حَسَّنْتَ خَلْقِي فَحَسِّنْ خُلُقِي",
    "latin": "Allahumma kamā ḥassan̄ta khalqī fa ḥassin khuluqī"
  },
  {
    "id": "36",
    "type": "Daily",
    "notes": "",
    "benefits": "",
    "source": "QS. Al-Mu'minun: 97-98",
    "fawaid": "Indeed, Allah commands the Prophet Muhammad and all his followers to seek refuge from the whispers of Satan in all activities, especially when approaching death. Satan whispers evil into the hearts of humans, encouraging wrongdoing.",
    "titleMalay": "Doa Berlindung dari Syaitan",
    "title": "Dua for Protection from Satan",
    "melayTranslation": "Ya Tuhanku aku berlindung kepada Engkau dari bisikan-bisikan syaitan dan aku berlindung (pula) kepada Engkau ya Tuhanku, dari kedatangan mereka kepadaku.",
    "translation": "My Lord, I seek refuge in You from the whispers of the devils, and I seek refuge in You, my Lord, lest they be present with me.",
    "arabic": "رَبِّ أَعُوْذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِيْنِ وَأَعُوْذُ بِكَ رَبِّ أَنْ يَحْضُرُوْنِ",
    "latin": "Rabbī a'ūdzu bika min hamazātis-shayāṭīn wa a'ūdzu bika rabbi an yaḥḍurūn"
  },
  {
    "id": "37",
    "type": "Daily",
    "notes": "",
    "benefits": "",
    "source": "Narrated by Abu Dawud (529), at-Tirmidhi (211), an-Nasa'i (2:26), Ibn Majah (722)",
    "fawaid": "This prayer is recommended by the Prophet Muhammad (peace be upon him) for those who hear the call to prayer. It has many benefits, including receiving intercession from the Prophet on the Day of Judgment, attaining the wasilah and honor in Paradise for the Prophet, and receiving great and commendable reward from Allah. It is also a way to show respect and admiration for Allah and His Messenger, expressing love and longing for the Prophet Muhammad, the role model for Muslims.",
    "titleMalay": "Doa Sesudah Adzan",
    "title": "Dua After the Call to Prayer (Adhan)",
    "melayTranslation": "Ya Allah, pemilik seruan yang sempurna ini dan sholat yang ditegakkan, anugerahkanlah kepada Nabi Muhammad; wasilah (kedudukan yang tinggi di surga) dan keutamaan (melebihi seluruh makhluk), dan bangkitkanlah beliau dalam kedudukan terpuji (memberi syafa'at) yang telah Engkau janjikan.",
    "translation": "O Allah, Lord of this perfect call and established prayer, grant Muhammad the means and virtue, and raise him to a praiseworthy station which You have promised him.",
    "arabic": "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلَاةِ الْقَائِمَةِ، آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ، وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ",
    "latin": "Allahumma rabba hāżihid-da'watit-tāmmati waṣ-ṣalātil-qā'imah, ātī Muḥammadan al-wasīlata wal-faḍīlah, wab'ath-hu maqāman maḥmūdan allażī wa'adtah"
  },
  {
    "id": "38",
    "type": "Daily",
    "notes": "",
    "benefits": "",
    "source": "QS. Ibrahim: 41",
    "fawaid": "This is a prayer of Prophet Ibrahim (peace be upon him), teaching us to honor and love our parents, remember the Day of Judgment, and care for fellow believers. By making this prayer, we hope that Allah will forgive our sins and make us among the faithful.",
    "titleMalay": "Doa Memohon Ampunan untuk Kedua Orang Tua",
    "title": "Dua for Forgiveness for Both Parents",
    "melayTranslation": "Ya Allah, rahmatilah mereka sebagaimana mereka membesarkanku ketika kecil",
    "translation": "O Allah, have mercy on them as they raised me when I was small.",
    "arabic": "راللَّهُمَّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا",
    "latin": "Allahummarḥamhumā kamā rabbayānī ṣaghīrā"
  },
  {
    "id": "77",
    "type": "FeatureDua",
    "titleMalay": "Doa Ditetapkan Islam",
    "title": "Dua to Remain Steadfast in Islam",
    "noDoa": 1,
    "arabic": "أَصْبَحْنَا عَلَى فِطْرَةِ الإِسْلَامِ وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ",
    "latin": "Asbahna 'ala fitratil Islam, wa 'ala kalimatil ikhlas, wa 'ala dini nabiyyina Muhammad ṣallallāhu 'alayhi wa sallam, wa 'ala millati abina Ibrahim ḥanifan musliman wa ma kana minal musyrikin",
    "melayTranslation": "Kami hayati pagi ini di atas landasan fitrah dan perwatakan Islam, berpegang kepada kalimah ikhlas (kalimah syahadah), dan berpegang kepada agama Nabi kami Muhammad SAW yang juga agama ayah kami Ibrahim, yang berada di atas jalan yang lurus, muslim dan tidak tergolong dari kalangan orang-orang musyrik.",
    "translation": "We begin the morning upon the natural disposition of Islam, the word of sincerity, the religion of our Prophet Muhammad (peace be upon him), and the way of our forefather Ibrahim, who was upright and not among the polytheists."
  },
  {
    "id": "78",
    "type": "FeatureDua",
    "titleMalay": "Doa Penghulu Bagi Mohon Keampunan",
    "title": "Dua - The Master Supplication for Seeking Forgiveness",
    "noDoa": 2,
    "arabic": "للَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي، فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ",
    "latin": "Allahumma anta Rabbi la ilaha illa anta, khalaqtani wa ana 'abduka, wa ana 'ala 'ahdika wa wa'dika ma istata'tu, a'udhu bika min sharri ma ṣana'tu, abu'u laka bini'matika 'alayya, wa abu'u bidhanbi, faghfirli fa'innahu la yaghfiru dhunuba illa anta.",
    "melayTranslation": "Ya Allah, Engkau adalah Tuhanku, tidak ada tuhan yang berhak disembah kecuali Engkau, Engkaulah yang menciptakanku dan aku adalah hamba-Mu. Aku akan setia pada perjanjian pada-Mu (iaitu aku akan mentaatkan-Mu) dan aku yakin akan janji-Mu (berupa syurga untukku) dengan segenap kemampuanku. Aku berlindung kepada-Mu dari kejahatan yang aku lakukan. Aku mengakui nikmat-Mu kepadaku dan aku mengakui dosaku, maka ampunilah aku. Sesungguhnya tiada yang mengampuni dosa kecuali Engka",
    "translation": "O Allah, You are my Lord, there is no deity but You. You created me and I am Your servant. I uphold Your covenant and promise as best as I can. I seek refuge in You from the evil I have done. I admit Your blessings upon me, and I confess my sins. So forgive me, for none forgives sins except You."
  },
  {
    "id": "79",

    "type": "FeatureDua",
    "titleMalay": "Doa Keampunan",
    "title": "Dua for Forgiveness",
    "noDoa": 3,
    "arabic": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
    "latin": "Allahumma inni zalamtu nafsi zulman kathiran, wa la yaghfiru dhunuba illa anta, faghfir li maghfiratan min 'indika warhamni, innaka anta al-Ghafur ar-Rahim.",
    "melayTranslation": "Ya Allah! Sungguh aku telah menzalimi diriku sendiri dengan kezaliman yang banyak, sedangkan tidak ada yang dapat mengampuni dosa-dosa kecuali Engkau. Maka ampunilah aku dengan suatu pengampunan dari sisi-Mu, dan rahmatilah aku. Sesungguhnya Engkau Maha Pengampun lagi Maha Penyayang",
    "translation": "O Allah! Indeed, I have wronged myself greatly, and none forgives sins except You. So forgive me with forgiveness from You, and have mercy on me. Indeed, You are the Most Forgiving, the Most Merciful."
  },
  {
    "id": "80",
    "type": "FeatureDua",
    "titleMalay": "Doa Mohon Taqwa",
    "title": "Dua to Seek Piety (Taqwa)",
    "noDoa": 4,
    "arabic": "اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلَاهَا",
    "latin": "Allahumma aati nafsi taqwaha, wa zakkiha anta khayru man zakkaha, anta waliyyuha wa mawlaha.",
    "melayTranslation": "Ya Allah, berikanlah ketakwaan pada jiwaku, dan bersihkanlah ia kerana Engkaulah sebaik-baik yang dapat membersihkannya. Engkaulah Pelindung dan Tuan kepadanya.",
    "translation": "O Allah, grant my soul its piety and purify it, for You are the best to purify it. You are its guardian and master."
  },
  {
    "id": "81",
    "type": "FeatureDua",
    "titleMalay": "Doa Pengiktirafan",
    "title": "Dua of Acknowledgement (of Sins or Submission)",
    "noDoa": 5,
    "arabic": "لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
    "latin": "La ilaha illa anta, subḥanaka inni kuntu minaz-zalimin.",
    "melayTranslation": "Sesungguhnya tiada Tuhan (yang dapat menolong) melainkan Engkau (ya Allah)! Maha Suci Engkau (daripada melakukan aniaya, tolongkanlah daku)! Sesungguhnya aku adalah daripada orang-orang yang menganiaya diri sendiri",
    "translation": "There is no god but You. Glory be to You, indeed I have been among the wrongdoers."
  },
  {
    "id": "82",
    "type": "FeatureDua",
    "titleMalay": "Doa Kelapangan Hati Dan Jiwa",
    "title": "Dua for Relief and Peace of Mind and Soul",
    "noDoa": 6,
    "arabic": "للَّهُمَّ إِنِّي عَبْدُكَ، وَابْنُ عَبْدِكَ، وَابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي",
    "latin": "Allahumma inni 'abduka, wabnu 'abduka, wabnu amatika, nasiyati biyadika, madin fiyya hukmuka, 'adlun fiyya qada'uka. As'aluka bikulli ismin huwa laka sammayta bihi nafsaka, aw anzaltahu fi kitabika, aw 'allamtahu ahadan min khalqika, awista'tharta bihi fi 'ilmi al-ghaybi 'indaka an taj'alal-Qur'ana rabi'a qalbi, wa nura sadri, wa jala'a huzni, wa dhahaba hammi.",
    "melayTranslation": "Ya Allah, sesungguhnya aku adalah hamba-Mu, anak lelaki kepada hamba-Mu, dan anak perempuan kepada hamba perempuan-Mu. Ubun-ubunku berada di tangan-Mu. Ketentuan-Mu berlaku padaku dan keputusan-Mu ke atasku adalah adil. Aku memohon kepada-Mu dengan setiap nama yang Engkau miliki, yang Engkau sendiri namakan diri-Mu dengannya, atau yang Engkau turunkan dalam kitab-Mu, atau yang Engkau ajarkan kepada mana-mana makhluk-Mu, atau yang Engkau simpan dalam ilmu ghaib di sisi-Mu, agar Engkau jadikan al-Quran sebagai penyejuk hatiku, cahaya di dadaku, pelenyap kesedihanku dan penghapus dukacitaku",
    "translation": "O Allah, I am Your servant, the son of Your servant, the son of Your maidservant. My forelock is in Your hand, Your command over me is forever executed and Your decree over me is just. I ask You by every name that belongs to You, which You have named Yourself with, or revealed in Your Book, or taught to any of Your creation, or preserved in the knowledge of the unseen with You, to make the Qur'an the spring of my heart, the light of my chest, the remover of my sadness, and the reliever of my distress."
  },
  {
    "id": "83",
    "type": "FeatureDua",
    "titleMalay": "Doa Keluar dan Kediaman",
    "title": "Dua When Leaving and Returning to Residence",
    "noDoa": 7,
    "arabic": "بِسْمِ اللهِ تَوَكَّلْتُ عَلَى اللهِ، لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ",
    "latin": "Bismillahi tawakkaltu 'alallahi, la hawla wa la quwwata illa billah.",
    "melayTranslation": "Dengan nama Allah, aku bertawakkal kepada Allah. Tiada upaya dan tiada kekuatan kecuali dengan Allah",
    "translation": "In the name of Allah, I place my trust in Allah. There is no power and no strength except with Allah."
  },
  {
    "id": "84",
    "type": "FeatureDua",
    "titleMalay": "Doa Petunjuk, Ketaqwaan Iffah dan Kekayaan",
    "title": "Dua for Guidance, Piety, Chastity, and Wealth",
    "noDoa": 8,
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى، وَالتُّقَى، وَالْعَفَافَ، وَالْغِنَى",
    "latin": "Allahumma inni as'aluka al-huda, wa at-tuqa, wal-'afafa, wal-ghina.",
    "melayTranslation": "Wahai Allah! Sesungguhnya aku memohon kepada-Mu petunjuk, ketakwaan, sifat iffah dan kekayaan",
    "translation": "O Allah! I ask You for guidance, piety, chastity, and self-sufficiency."
  },
  {
    "id": "85",
    "type": "FeatureDua",
    "titleMalay": "Doa Ditunjukkan Kebenaran",
    "title": "Dua to Be Shown the Truth",
    "noDoa": 9,
    "arabic": "للَّهُمَّ رَبَّ جِبْرِيلَ، وَمِيكَائِيلَ، وَإِسْرَافِيلَ، فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ، اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ، إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ",
    "latin": "Allahumma rabb Jibril wa Mika'il wa Israfil, fatiras-samawati wal-ardh, 'alimul-ghaibi wash-shahadah, anta tahkumu baina 'ibadika fima kanu fihi yakhtalifun, ihdini lima-khtulifa fihi minal-haqqi bi idhnika, innaka tahdi man tasha'u ila siratin mustaqim.",
    "melayTranslation": "Ya Allah, Tuhan Jibril, Mikail, dan Israfil. Yang Menciptakan langit dan bumi, Yang Maha Mengetahui yang ghaib mahupun yang kelihatan. Engkaulah yang Menghakimi hamba-hamba-Mu di dalam apa yang mereka perselisihkan. Tunjukkanlah aku dengan izin-Mu kepada kebenaran di dalam apa yang diperselisihkan. Sesungguhnya Engkau memberi petunjuk ke arah Sirat al-Mustaqim kepada sesiapa yang Engkau Kehendaki.",
    "translation": "O Allah, Lord of Jibril, Mikail, and Israfil, Creator of the heavens and the earth, Knower of the unseen and the seen, You judge between Your servants concerning that wherein they differ. Guide me by Your permission to the truth in that wherein they differ. Indeed, You guide whom You will to a straight path."
  },
  {
    "id": "86",
    "type": "FeatureDua",
    "titleMalay": "Doa Ilmu, Rezeki dan Amalan",
    "title": "Dua for Knowledge, Sustenance, and Good Deeds",
    "noDoa": 10,
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا",
    "latin": "Allahumma inni as'aluka 'ilman nafi'an, wa rizqan tayyiban, wa 'amalan mutaqabbalan.",
    "melayTranslation": "Ya Allah, aku memohon kepada-Mu ilmu yang bermanfaat, rezeki yang baik dan amalan yang diterima",
    "translation": "O Allah, I ask You for beneficial knowledge, good provision, and accepted deeds."
  },
   {
      "type":"DuaForSeekingHelp",
      "id": "87",
      "titleMalay": "Doa 1",
      "title": "Dua 1",
      "noDoa": 1,
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ الْقَضَاءِ، وَشَمَاتَةِ الْأَعْدَاءِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ، لَا إِلَهَ إِلَّا أَنْتَ، سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ.",
      "latin": "Allahumma inni a'udhu bika min jahdil-bala', wa darakis-shaqa', wa su'il-qada', wa shamatatil-a'da'. Allahumma inni a'udhu bika min zawali ni'matika, wa tahawwuli 'afiyatika, wa fuja'ati niqmatika, wa jami'i sakhatika. La ilaha illa anta, subhanaka inni kuntu minaz-zhalimin.",
      "melayTranslation": "Ya Allah, aku berlindung dengan-Mu daripada ujian yang berat, ditimpa kecelakaan, buruknya takdir dan kegembiraan para musuh (atas ujian dan kecelakaan yang menimpaku). Ya Allah, aku juga berlindung kepada-Mu daripada hilangnya nikmat yang Engkau berikan, berubahnya kesihatan yang Engkau kurniakan, daripada bala bencana yang datang secara tiba-tiba serta daripada segala perkara yang Engkau murkai. Tiada tuhan melainkan Engkau dan sesungguhnya aku termasuk dalam kalangan orang yang zalim.",
      "translation": "O Allah, I seek refuge in You from severe trials, calamities, evil fate, and the joy of enemies over my misfortunes. O Allah, I also seek refuge in You from the loss of the blessings You have given, the change of the health You have bestowed, the sudden coming of calamities, and from everything that earns Your wrath. There is no god but You, and indeed, I am among the wrongdoers."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "88",
      "titleMalay": "Doa 2",
      "title": "Dua 2",
      "noDoa": 2,
      "arabic": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
      "latin": "Bismillahilladzi la yadurru ma'asmihi shai'un fil-ardhi wa la fissama'i wa huwa as-sami'ul-'alim.",
      "melayTranslation": "Dengan nama Allah yang mana dengan nama-Nya sesuatu yang berada di bumi dan di langit tidak boleh mendatangkan mudarat. Dia Tuhan Yang Maha Mendengar lagi Maha Mengetahui.",
      "translation": "In the name of Allah, with whose name nothing in the earth or the heavens can cause harm. He is the All-Hearing, the All-Knowing."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "89",
      "titleMalay": "Doa 3",
      "title": "Dua 3",
      "noDoa": 3,
      "arabic": "اللَّهُمَّ رَحْمَتَكَ أَرْجُو فَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ وَأَصْلِحْ لِي شَأْنِي كُلَّهُ لَا إِلَهَ إِلَّا أَنْتَ",
      "latin": "Allahumma rahmataka arju fala takilni ila nafsi tharfata 'ain, wa aslih li sha'ni kullahu, la ilaha illa anta.",
      "melayTranslation": "Ya Allah, dengan rahmat-Mu aku berharap. Janganlah Engkau biarkan urusanku pada diriku sendiri walau sekadar sekelip mata dan perbaikilah seluruh urusanku. Tiada Tuhan yang berhak disembah melainkan Engkau",
      "translation": "O Allah, by Your mercy I seek help. Do not leave me to myself even for the blink of an eye and rectify all of my affairs. There is no deity worthy of worship but You."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "90",
      "titleMalay": "Doa 4",
      "title": "Dua 4",
      "noDoa": 4,
      "arabic": "اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلَاهَا",
      "latin": "Allahumma ati nafsi taqwaha, wa zakkiha anta khairu man zakkaha, anta waliyyuha wa mawlaha.",
      "melayTranslation": "Ya Allah, berikanlah ketakwaan kepada jiwaku dan sucikanlah ia, kerana Engkaulah sebaik-baik yang menyucikannya. Engkaulah pelindung dan tuannya",
      "translation": "O Allah, grant my soul its piety and purify it, for You are the best to purify it. You are its Guardian and Master."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "91",
      "titleMalay": "Doa 5",
      "title": "Dua 5",
      "noDoa": 5,
      "arabic": "اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
      "latin": "Allahummakfini bihalalika 'an haramika, wa aghnini bifadhlika 'amman siwaka.",
      "melayTranslation": "Ya Allah, cukupkanlah aku dengan rezeki yang halal daripada yang haram, dan kayakanlah aku dengan limpah kurnia-Mu daripada bergantung kepada selain-Mu",
      "translation": "O Allah, suffice me with what is halal from what is haram, and enrich me with Your bounty from needing anyone besides You."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "92",
      "titleMalay": "Doa 6",
      "title": "Dua 6",
      "noDoa": 6,
      "arabic": "اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ، أَوْ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي",
      "latin": "Allahumma inni 'abduka, ibnu 'abdika, ibnu amatika, nasiyati biyadik, madin fiyya hukmuk, 'adlun fiyya qada'uk. As'aluka bikulli ismin huwa laka, sammayta bihi nafsak, aw anzaltahu fi kitabik, aw 'allamtahu ahadan min khalqik, aw ista'tharta bihi fi 'ilmil-ghaybi 'indak. An taj'ala al-Qur'ana rabi'a qalbi, wa nura sadri, wa jala'a huzni, wa dhahaba hammi.",
      "melayTranslation": "Ya Allah, aku adalah hamba-Mu, anak lelaki kepada hamba-Mu, dan anak perempuan kepada hamba perempuan-Mu. Ubun-ubunku berada di tangan-Mu. Ketentuan-Mu padaku tetap berlaku dan keputusan-Mu terhadapku adalah adil",
      "translation": "O Allah, I am Your servant, son of Your servant, son of Your maidservant. My forelock is in Your hand. Your judgment upon me is assured and Your decree concerning me is just."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "93",
      "titleMalay": "Doa 7",
      "title": "Dua 7",
      "noDoa": 7,
      "arabic": "بِسْمِ اللَّهِ، تَوَكَّلْتُ عَلَى اللَّهِ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
      "latin": "Bismillah, tawakkaltu 'alallah, wa la hawla wa la quwwata illa billah.",
      "melayTranslation": "Dengan nama Allah, aku bertawakkal kepada Allah. Tiada daya dan tiada kekuatan kecuali dengan Allah",
      "translation": "In the name of Allah, I place my trust in Allah. There is no power nor might except with Allah."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "94",
      "titleMalay": "Doa Petunjuk, Ketaqwaan Iffah dan Kekayaan",
      "title": "Dua for Guidance, Piety, Chastity, and Wealth",
      "noDoa": 8,
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى، وَالتُّقَى، وَالْعَفَافَ، وَالْغِنَى",
      "latin": "Allahumma inni as'aluka al-huda, wa at-tuqa, wal-'afafa, wal-ghina.",
      "melayTranslation": "Wahai Allah! Sesungguhnya aku memohon kepada-Mu petunjuk, ketakwaan, sifat iffah dan kekayaan",
      "translation": "O Allah! I ask You for guidance, piety, chastity, and self-sufficiency."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "95",
      "titleMalay": "Doa 9",
      "title": "Dua 9",
      "noDoa": 9,
      "arabic": "اللَّهُمَّ رَبَّ جِبْرِيلَ وَمِيكَائِيلَ وَإِسْرَافِيلَ، فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ، اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ، إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَىٰ صِرَاطٍ مُسْتَقِيمٍ",
      "latin": "Allahumma Rabb Jibril wa Mikail wa Israfil, fatiras-samawati wal-ardh, 'alimal-ghaibi wash-shahadah, anta tahkumu baina 'ibadika fima kanu fihi yakhtalifun, ihdini lima khtulifa fihi minal-haqqi bi idhnika, innaka tahdi man tasha'u ila siratin mustaqim.",
      "melayTranslation": "Ya Allah, Tuhan Jibril, Mikail dan Israfil. Pencipta langit dan bumi, Yang Mengetahui perkara ghaib dan nyata. Engkau menghukum antara hamba-hamba-Mu terhadap perkara yang mereka perselisihkan. Tunjukkanlah aku kepada kebenaran dalam hal yang mereka perselisihkan dengan izin-Mu. Sesungguhnya Engkau memberi petunjuk kepada sesiapa yang Engkau kehendaki ke jalan yang lurus",
      "translation": "O Allah, Lord of Jibril, Mika'il, and Israfil. Creator of the heavens and the earth, Knower of the unseen and the seen. You judge between Your servants in what they dispute. Guide me, by Your permission, to the truth in what they dispute. Verily, You guide whom You will to the straight path."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "96",
      "titleMalay": "Doa 10",
      "title": "Dua 10",
      "noDoa": 10,
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ",
      "latin": "Allahumma inni a'udhu bika min zawali ni'matika, wa tahawwuli 'afiyatika, wa fuja'ati niqmatika, wa jami'i sakhatika.",
      "melayTranslation": "Ya Allah, aku berlindung kepada-Mu daripada hilangnya nikmat-Mu, berubahnya kesejahteraan-Mu, datangnya bala secara tiba-tiba dan daripada segala kemurkaan-Mu",
      "translation": "O Allah, I seek refuge in You from the loss of Your blessings, the change of Your protection, the suddenness of Your punishment, and all forms of Your wrath."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "97",
      "titleMalay": "Doa 11",
      "title": "Dua 11",
      "noDoa": 11,
      "arabic": "اللَّهُمَّ اجْعَلْنِي صَبُورًا، وَاجْعَلْنِي شَكُورًا، وَاجْعَلْنِي فِي عَيْنِي صَغِيرًا، وَفِي أَعْيُنِ النَّاسِ كَبِيرًا",
      "latin": "Allahumma aj'alni shabura, waj'alni shakura, waj'alni fi 'ayni shaghira, wa fi a'yuni an-nasi kabira.",
      "melayTranslation": "Ya Allah, jadikanlah aku seorang yang sabar, dan jadikanlah aku seorang yang bersyukur. Jadikanlah aku kecil pada pandangan diriku sendiri dan besar pada pandangan orang lain",
      "translation": "O Allah, make me among the patient ones and the thankful ones. Make me humble in my own eyes and honorable in the sight of others."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "98",
      "titleMalay": "Doa 12",
      "title": "Dua 12",
      "noDoa": 12,
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الرِّضَا بَعْدَ الْقَضَاءِ، وَبَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَلَذَّةَ النَّظَرِ إِلَىٰ وَجْهِكَ، وَالشَّوْقَ إِلَىٰ لِقَائِكَ",
      "latin": "Allahumma inni as'aluka ridha ba'dal-qada', wa barda al-'ayshi ba'dal-mawt, wa ladhdhatan-nazhari ila wajhik, wasy-shawqa ila liqa'ika.",
      "melayTranslation": "Ya Allah, aku memohon kepada-Mu keredaan selepas takdir-Mu, kehidupan yang sejuk selepas kematian, kenikmatan memandang wajah-Mu, dan kerinduan untuk bertemu dengan-Mu.",
      "translation": "O Allah, I ask You for satisfaction after Your decree, a pleasant life after death, the delight of gazing upon Your face, and longing to meet You."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "99",
      "titleMalay": "Doa 13",
      "title": "Dua 13",
      "noDoa": 13,
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ",
      "latin": "Allahumma inni a'udhu bika min zawali ni'matik, wa tahawwuli 'afiyatik, wa fuja'ati niqmatik, wa jami'i sakhatik.",
      "melayTranslation": "Ya Allah, aku berlindung kepada-Mu daripada hilangnya nikmat-Mu, berubahnya kesejahteraan-Mu, datangnya bala secara tiba-tiba dan daripada segala kemurkaan-Mu",
      "translation": "O Allah, I seek refuge in You from the loss of Your blessings, the change of Your protection, the suddenness of Your punishment, and all forms of Your wrath."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "100",
      "titleMalay": "Doa 14",
      "title": "Dua 14",
      "noDoa": 14,
      "arabic": "اللَّهُمَّ اهْدِنِي وَسَدِّدْنِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالسَّدَادَ",
      "latin": "Allahumma ihdini wasaddidni, Allahumma inni as'alukal-huda was-sadad.",
      "melayTranslation": "Ya Allah, berilah aku petunjuk dan ketetapan yang benar. Ya Allah, aku memohon kepada-Mu petunjuk dan keteguhan dalam jalan kebenaran.",
      "translation": "O Allah, grant me guidance and firmness in truth. O Allah, I ask You for guidance and steadfastness on the path of righteousness."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "101",
      "titleMalay": "Doa 15",
      "title": "Dua 15",
      "noDoa": 15,
      "arabic": "اللَّهُمَّ طَهِّرْ قَلْبِي مِنَ النِّفَاقِ، وَعَمَلِي مِنَ الرِّيَاءِ، وَلِسَانِي مِنَ الْكَذِبِ، وَعَيْنِي مِنَ الْخِيَانَةِ، فَإِنَّكَ تَعْلَمُ خَائِنَةَ الْأَعْيُنِ وَمَا تُخْفِي الصُّدُورُ",
      "latin": "Allahumma tahhir qalbi minan-nifaq, wa 'amali minar-riya', wa lisani minal-kadhib, wa 'ayni minal-khiyanah, fa innaka ta'lamu kha'inatal-a'yuni wa ma tukhfis-sudur.",
      "melayTranslation": "Ya Allah, sucikanlah hatiku daripada sifat munafik, amalanku daripada riak, lidahku daripada berdusta, dan mataku daripada khianat. Sesungguhnya Engkau Maha Mengetahui segala yang tersembunyi di mata dan apa yang tersimpan di hati",
      "translation": "O Allah, purify my heart from hypocrisy, my deeds from showing off, my tongue from lying, and my eyes from betrayal. Verily, You know what the eyes conceal and what the hearts hide."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "102",
      "titleMalay": "Doa 16",
      "title": "Dua 16",
      "noDoa": 16,
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْجُبْنِ، وَأَعُوذُ بِكَ مِنَ الْبُخْلِ، وَأَعُوذُ بِكَ أَنْ أُرَدَّ إِلَىٰ أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ",
      "latin": "Allahumma inni a'udhu bika minal-jubni, wa a'udhu bika minal-bukhl, wa a'udhu bika an uradda ila ardhalil-'umur, wa a'udhu bika min fitnatid-dunya, wa a'udhu bika min 'adzabil-qabr.",
      "melayTranslation": "Ya Allah, aku berlindung kepada-Mu daripada sifat pengecut, daripada sifat kedekut, daripada usia tua yang tidak berguna, daripada fitnah dunia, dan daripada azab kubur",
      "translation": "O Allah, I seek refuge in You from cowardice, miserliness, helpless old age, worldly trials, and the torment of the grave."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "103",
      "titleMalay": "Doa 17",
      "title": "Dua 17",
      "noDoa": 17,
      "arabic": "اللَّهُمَّ اجْعَلْنِي مِنْ أَهْلِ الْقُرْآنِ، الَّذِينَ هُمْ أَهْلُكَ وَخَاصَّتُكَ",
      "latin": "Allahumma aj'alni min ahlil-Qur'an, alladhina hum ahluka wa khassatuka.",
      "melayTranslation": "Ya Allah, jadikanlah aku dalam kalangan ahli al-Quran, iaitu golongan yang merupakan ahli-Mu dan orang yang istimewa di sisi-Mu",
      "translation": "O Allah, make me among the people of the Qur'an, those who are Your special ones and closest to You."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "104",
      "titleMalay": "Doa 18",
      "title": "Dua 18",
      "noDoa": 18,
      "arabic": "اللَّهُمَّ اجْعَلْ خَيْرَ عُمْرِي آخِرَهُ، وَخَيْرَ عَمَلِي خَوَاتِمَهُ، وَخَيْرَ أَيَّامِي يَوْمَ أَلْقَاكَ فِيهِ",
      "latin": "Allahumma aj'al khayra 'umri akhirahu, wa khayra 'amali khawatimahu, wa khayra ayyami yawma alqaka fihi.",
      "melayTranslation": "Ya Allah, jadikanlah sebaik-baik umurku pada penghujungnya, sebaik-baik amalanku pada penutupnya dan sebaik-baik hariku adalah pada hari aku bertemu dengan-Mu",
      "translation": "O Allah, make the best part of my life its end, the best of my deeds the last of them, and the best of my days the day I meet You."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "105",
      "titleMalay": "Doa 19",
      "title": "Dua 19",
      "noDoa": 19,
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ نَفْسًا مُطْمَئِنَّةً، تُؤْمِنُ بِلِقَائِكَ، وَتَرْضَىٰ بِقَضَائِكَ، وَتَقْنَعُ بِعَطَائِكَ",
      "latin": "Allahumma inni as'aluka nafsan mutma'innah, tu'minu biliqa'ika, wa tardha biqada'ika, wa taqna'u bi'ata'ika.",
      "melayTranslation": "Ya Allah, aku memohon kepada-Mu jiwa yang tenang, yang beriman kepada pertemuan dengan-Mu, redha dengan ketentuan-Mu dan merasa cukup dengan pemberian-Mu",
      "translation": "O Allah, I ask You for a soul at peace, believing in meeting You, content with Your decree, and satisfied with Your provision."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "106",
      "titleMalay": "Doa 20",
      "title": "Dua 20",
      "noDoa": 20,
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا",
      "latin": "Allahumma inni as'aluka 'ilman nafi'a, wa rizqan tayyiba, wa 'amalan mutaqabbala.",
      "melayTranslation": "Ya Allah, aku memohon kepada-Mu ilmu yang bermanfaat, rezeki yang baik dan amalan yang diterima",
      "translation": "O Allah, I ask You for beneficial knowledge, good provision, and accepted deeds."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "107",
      "titleMalay": "Doa 21",
      "title": "Dua 21",
      "noDoa": 21,
      "arabic": "اللَّهُمَّ إِنِّّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ، وَعَزَائِمَ مَغْفِرَتِكَ، وَالسَّلَامَةَ مِنْ كُلِّ إِثْمٍ، وَالْغَنِيمَةَ مِنْ كُلِّ بِرٍّ، وَالْفَوْزَ بِالْجَنَّةِ، وَالنَّجَاةَ مِنَ النَّارِ",
      "latin": "Allahumma inni as'aluka muji-bati rahmatika, wa 'aza'ima maghfiratika, was-salamata min kulli ithmin, wal-ghanimata min kulli birrin, wal-fawza bil-jannah, wan-najata minan-nar.",
      "melayTranslation": "Ya Allah, aku memohon kepada-Mu sebab-sebab yang mendatangkan rahmat-Mu, keteguhan dalam keampunan-Mu, keselamatan dari setiap dosa, keuntungan dari setiap kebaikan, kemenangan memperoleh syurga dan keselamatan dari api neraka",
      "translation": "O Allah, I ask You for the means of receiving Your mercy, the resolve to obtain Your forgiveness, safety from every sin, gain from every virtue, attainment of Paradise, and salvation from the Fire."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "108",
      "titleMalay": "Doa 22",
      "title": "Dua 22",
      "noDoa": 22,
      "arabic": "اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
      "latin": "Allahummakfini bihalalika 'an haramika, wa aghnini bifadhlika 'amman siwaka.",
      "melayTranslation": "Ya Allah, cukupkanlah aku dengan yang halal daripada yang haram dan kayakanlah aku dengan kurnia-Mu daripada bergantung kepada selain-Mu",
      "translation": "O Allah, suffice me with what is halal from what is haram and enrich me with Your bounty from needing anyone besides You."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "109",
      "titleMalay": "Doa 23",
      "title": "Dua 23",
      "noDoa": 23,
      "arabic": "اللَّهُمَّ أَلِّفْ بَيْنَ قُلُوبِنَا، وَأَصْلِحْ ذَاتَ بَيْنِنَا، وَاهْدِنَا سُبُلَ السَّلَامِ، وَنَجِّنَا مِنَ الظُّلُمَاتِ إِلَى النُّورِ، وَجَنِّبْنَا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ",
      "latin": "Allahumma allif baina qulubina, wa aslih dzata bainina, wahdina subulas-salam, wa najjina minadz-dhulumati ilan-nur, wa jannibnal-fawahisha ma dhahara minha wa ma bathan.",
      "melayTranslation": "Ya Allah, satukanlah hati kami, perbaikilah hubungan antara kami, tunjukkanlah kami jalan keselamatan, selamatkanlah kami daripada kegelapan kepada cahaya dan jauhkanlah kami daripada segala kejahatan sama ada yang zahir mahupun yang tersembunyi",
      "translation": "O Allah, unite our hearts, mend our relationships, guide us to paths of peace, and deliver us from darkness to light. Keep us away from evil, both apparent and hidden."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "110",
      "titleMalay": "Doa 24",
      "title": "Dua 24",
      "noDoa": 24,
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ صَلَاحَ الْقَلْبِ، وَحُسْنَ الْخُلُقِ، وَسَعَةَ الرِّزْقِ، وَسَكِينَةَ النَّفْسِ، وَطِيبَ الْعَيْشِ، وَرِضَاكَ وَالْجَنَّةَ",
      "latin": "Allahumma inni as'aluka shalaha al-qalbi, wa husnal-khuluqi, wa sa'ata ar-rizqi, wa sakinata an-nafsi, wa tayyib al-'ayshi, wa ridhaka wal-jannah.",
      "melayTranslation": "Ya Allah, aku memohon kepada-Mu hati yang baik, akhlak yang mulia, rezeki yang luas, ketenangan jiwa, kehidupan yang baik, keredaan-Mu dan syurga",
      "translation": "O Allah, I ask You for a good heart, noble character, abundant provision, peace of soul, a good life, Your pleasure, and Paradise."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "111",
      "titleMalay": "Doa 25",
      "title": "Dua 25",
      "noDoa": 25,
      "arabic": "اللَّهُمَّ اجْعَلْنِي مِنْ التَّوَّابِينَ، وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ، وَاجْعَلْنِي مِنْ عِبَادِكَ الصَّالِحِينَ",
      "latin": "Allahumma aj'alni minat-tawwabin, waj'alni minal-mutathahhirin, waj'alni min 'ibadikas-salihin.",
      "melayTranslation": "Ya Allah, jadikanlah aku daripada kalangan orang yang bertaubat, jadikanlah aku dari kalangan orang yang menyucikan diri dan jadikanlah aku dari kalangan hamba-hamba-Mu yang soleh.",
      "translation": "O Allah, make me among those who repent, those who purify themselves, and Your righteous servants."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "112",
      "titleMalay": "Doa 26",
      "title": "Dua 26",
      "noDoa": 26,
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالْجَنَّةَ، وَأَعُوذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ",
      "latin": "Allahumma inni as'aluka ridhaka wal-jannah, wa a'udhu bika min sakhatika wan-nar.",
      "melayTranslation": "Ya Allah, aku memohon keredaan-Mu dan syurga, serta aku berlindung kepada-Mu daripada kemurkaan-Mu dan neraka",
      "translation": "O Allah, I ask for Your pleasure and Paradise, and I seek refuge in You from Your wrath and the Hellfire."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "113",
      "titleMalay": "Doa 27",
      "title": "Dua 27",
      "noDoa": 27,
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ بِهِ عَبْدُكَ وَنَبِيُّكَ",
      "latin": "Allahumma inni as'aluka min khairi ma sa'alaka 'abduka wa nabiyyuka, wa a'udhu bika min sharri ma ista'adhabihi 'abduka wa nabiyyuka.",
      "melayTranslation": "Ya Allah, aku memohon kepada-Mu segala kebaikan yang pernah diminta oleh hamba dan nabi-Mu, dan aku memohon perlindungan kepada-Mu daripada segala kejahatan yang pernah dipohon perlindungan oleh hamba dan nabi-Mu.",
      "translation": "O Allah, I ask You for all the good that Your servant and Prophet asked of You, and I seek refuge in You from all the evil that Your servant and Prophet sought refuge from."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "114",
      "titleMalay": "Doa 28",
      "title": "Dua 28",
      "noDoa": 28,
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ",
      "latin": "Allahumma inni a'udhu bika min zawali ni'matika, wa tahawwuli 'afiyatika, wa fuja'ati niqmatika, wa jami'i sakhatika.",
      "melayTranslation": "Ya Allah, aku berlindung kepada-Mu daripada hilangnya nikmat-Mu, berubahnya kesejahteraan-Mu, datangnya bala secara tiba-tiba dan daripada segala kemurkaan-Mu",
      "translation": "O Allah, I seek refuge in You from the loss of Your blessings, the change of Your protection, the suddenness of Your punishment, and all forms of Your wrath."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "115",
      "titleMalay": "Doa 29",
      "title": "Dua 29",
      "noDoa": 29,
      "arabic": "اللَّهُمَّ اجْعَلْنِي مِنَ الصَّابِرِينَ، وَارْزُقْنِي تَقْوَاكَ، وَثَبِّتْ قَلْبِي عَلَى دِينِكَ",
      "latin": "Allahumma aj'alni minash-shabirin, warzuqni taqwaka, wathabbit qalbi 'ala dinika.",
      "melayTranslation": "Ya Allah, jadikanlah aku dalam kalangan orang yang sabar, kurniakan aku takwa kepada-Mu dan tetapkan hatiku atas agama-Mu",
      "translation": "O Allah, make me among the patient ones, grant me piety, and keep my heart firm upon Your religion."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "116",
      "titleMalay": "Doa 30",
      "title": "Dua 30",
      "noDoa": 30,
      "arabic": "اللَّهُمَّ اجْعَلْنِي خَيْرًا مِمَّا يَظُنُّونَ، وَلَا تُؤَاخِذْنِي بِمَا يَقُولُونَ، وَاغْفِرْ لِي مَا لَا يَعْلَمُونَ",
      "latin": "Allahumma aj'alni khayran mimma yadhunnun, wa la tu'akhidhni bima yaqulun, waghfir li ma la ya'lamun.",
      "melayTranslation": "Ya Allah, jadikanlah aku lebih baik daripada apa yang mereka sangkakan, janganlah Engkau mengazabku kerana apa yang mereka katakan, dan ampunilah aku atas apa yang mereka tidak ketahui",
      "translation": "O Allah, make me better than what they think of me, forgive me for what they don't know, and do not take me to account for what they say."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "117",
      "titleMalay": "Doa 31",
      "title": "Dua 31",
      "noDoa": 31,
      "arabic": "اللَّهُمَّ اجْعَلْنِي أُحِبُّكَ وَأُحِبُّ مَنْ يُحِبُّكَ، وَأَحِبُّ كُلَّ عَمَلٍ يُقَرِّبُنِي إِلَىٰ حُبِّكَ",
      "latin": "Allahumma aj'ilni uhibbuka wa uhibbu man yuhibbuka, wa uhibbu kulla 'amalin yuqarribuni ila hubbika.",
      "melayTranslation": "Ya Allah, jadikanlah aku mencintai-Mu, mencintai orang yang mencintai-Mu dan mencintai setiap amalan yang mendekatkan aku kepada cinta-Mu.",
      "translation": "O Allah, make me love You, love those who love You, and love every deed that brings me closer to Your love."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "118",
      "titleMalay": "Doa 32",
      "title": "Dua 32",
      "noDoa": 32,
      "arabic": "اللَّهُمَّ بَارِكْ لِي فِيمَا رَزَقْتَنِي، وَاغْفِرْ لِي وَارْحَمْنِي، وَتَوَفَّنِي وَأَنْتَ رَاضٍ عَنِّي",
      "latin": "Allahumma barik li fima razaqtani, waghfir li, warhamni, watawaffani wa anta radin 'anni.",
      "melayTranslation": "Ya Allah, berkatilah aku dalam rezeki yang telah Engkau kurniakan, ampunilah aku, rahmatilah aku, dan matikanlah aku dalam keadaan Engkau redha kepadaku",
      "translation": "O Allah, bless me in the provision You have granted me, forgive me, have mercy on me, and let me die while You are pleased with me."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "119",
      "titleMalay": "Doa 33",
      "title": "Dua 33",
      "noDoa": 33,
      "arabic": "اللَّهُمَّ اجْعَلْنِي مِنْ أَهْلِ التَّوَكُّلِ، وَاجْعَلْنِي مِنَ الْمُتَوَاضِعِينَ، وَاجْعَلْنِي مِنَ الصَّالِحِينَ",
      "latin": "Allahumma aj'alni min ahlit-tawakkul, waj'alni minal-mutawadhi'in, waj'alni minas-salihin.",
      "melayTranslation": "Ya Allah, jadikanlah aku dari kalangan orang yang bertawakkal, dari kalangan orang yang tawaduk, dan dari kalangan orang-orang yang soleh",
      "translation": "O Allah, make me among those who trust You, those who are humble, and those who are righteous."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "120",
      "titleMalay": "Doa 34",
      "title": "Dua 34",
      "noDoa": 34,
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ حُبَّكَ، وَحُبَّ مَنْ يُحِبُّكَ، وَالْعَمَلَ الَّذِي يُبَلِّغُنِي حُبَّكَ",
      "latin": "Allahumma inni as'aluka hubbaka, wa hubba man yuhibbuka, wal-'amala alladzi yuballighuni hubbaka.",
      "melayTranslation": "Ya Allah, aku memohon kepada-Mu kecintaan kepada-Mu, kecintaan kepada orang yang mencintai-Mu, dan amalan yang dapat menyampaikan aku kepada cinta-Mu",
      "translation": "O Allah, I ask You for love of You, love of those who love You, and love of deeds that will bring me closer to You."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "121",
      "titleMalay": "Doa 35",
      "title": "Dua 35",
      "noDoa": 35,
      "arabic": "اللَّهُمَّ ارْزُقْنِي قَلْبًا سَلِيمًا، وَلِسَانًا صَادِقًا، وَخُلُقًا حَسَنًا، وَرِزْقًا حَلَالًا طَيِّبًا",
      "latin": "Allahumma arzuqni qalban saliman, wa lisanan shadiqan, wa khuluqan hasanan, wa rizqan halalan tayyiban.",
      "melayTranslation": "Ya Allah, kurniakanlah aku hati yang sejahtera, lidah yang jujur, akhlak yang baik, dan rezeki yang halal lagi baik",
      "translation": "O Allah, grant me a sound heart, a truthful tongue, noble character, and lawful and good provision."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "122",
      "titleMalay": "Doa 36",
      "title": "Dua 36",
      "noDoa": 36,
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ نَفْسًا مُطْمَئِنَّةً، تُؤْمِنُ بِلِقَائِكَ، وَتَرْضَىٰ بِقَضَائِكَ، وَتَقْنَعُ بِعَطَائِكَ",
      "latin": "Allahumma inni as'aluka nafsan mutma'innah, tu'minu biliqa'ika, wa tardha biqada'ika, wa taqna'u bi'ata'ika.",
      "melayTranslation": "Ya Allah, aku memohon kepada-Mu jiwa yang tenang, yang beriman dengan pertemuan dengan-Mu, redha dengan ketentuan-Mu dan merasa cukup dengan pemberian-Mu.",
      "translation": "O Allah, I ask You for a peaceful soul that believes in meeting You, is content with Your decree, and is satisfied with Your gifts."
    },
    {
      "type":"DuaForSeekingHelp",
      "id": "123",
      "titleMalay": "Doa 37",
      "title": "Dua 37",
      "noDoa": 37,
      "arabic": "اللَّهُمَّ اجْعَلْنِي مِمَّنْ طَالَ عُمُرُهُ وَحَسُنَ عَمَلُهُ، وَأَحْسَنْتَ خَاتِمَتَهُ، وَكَثَّرْتَ أَرْزَاقَهُ، وَوَفَّقْتَهُ لِطَاعَتِكَ",
      "latin": "Allahumma aj'alni mimman tala 'umuruhu wa hasuna 'amaluhu, wa ahsanta khatimatahu, wa katharta arzaqahu, wa waffaqtahu lita'atik.",
      "melayTranslation": "Ya Allah, jadikanlah aku dari kalangan orang yang panjang umurnya, baik amalannya, indah penutup kehidupannya, banyak rezekinya, dan sentiasa Engkau beri taufik untuk taat kepada-Mu",
      "translation": "O Allah, make me among those who have long lives, good deeds, a beautiful ending, abundant provision, and whom You guide to obey You."
    }
]
